In [2]:
import pandas as pd
list=[["google","sales execurtive","bachlor",0],
      ["google","sales execurtive","master",0],
    ["google","bussiness manager","bachlor",1],
    ["google","bussiness manager","master",1],
    ["google","computer programmer","bachlor",1]]
list

[['google', 'sales execurtive', 'bachlor', 0],
 ['google', 'sales execurtive', 'master', 0],
 ['google', 'bussiness manager', 'bachlor', 1],
 ['google', 'bussiness manager', 'master', 1],
 ['google', 'computer programmer', 'bachlor', 1]]

In [4]:
from pandas import DataFrame
df=pd.DataFrame(list,columns=["company","job","degree","salary more than 10k"])

In [5]:
df

  company                  job   degree  salary more than 10k
0  google     sales execurtive  bachlor                     0
1  google     sales execurtive   master                     0
2  google    bussiness manager  bachlor                     1
3  google    bussiness manager   master                     1
4  google  computer programmer  bachlor                     1

In [11]:
input=df.drop("salary more than 10k",axis="columns")
target=df["salary more than 10k"]

In [12]:
input

  company                  job   degree
0  google     sales execurtive  bachlor
1  google     sales execurtive   master
2  google    bussiness manager  bachlor
3  google    bussiness manager   master
4  google  computer programmer  bachlor

In [13]:
target

0    0
1    0
2    1
3    1
4    1
Name: salary more than 10k, dtype: int64

In [14]:
from sklearn.preprocessing import LabelEncoder
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [18]:
input['company_n']=le_company.fit_transform(input['company'])
input['job_n']=le_company.fit_transform(input['job'])
input['degree_n']=le_company.fit_transform(input['degree'])

In [19]:
input

  company                  job   degree  company_n  job_n  degree_n
0  google     sales execurtive  bachlor          0      2         0
1  google     sales execurtive   master          0      2         1
2  google    bussiness manager  bachlor          0      0         0
3  google    bussiness manager   master          0      0         1
4  google  computer programmer  bachlor          0      1         0

In [22]:
input_n=input.drop(["company",'job','degree'],axis='columns')
input_n

   company_n  job_n  degree_n
0          0      2         0
1          0      2         1
2          0      0         0
3          0      0         1
4          0      1         0

In [23]:
from sklearn import tree

In [24]:
model=tree.DecisionTreeClassifier()

In [25]:
model.fit(input_n,target)

DecisionTreeClassifier()

In [26]:
model.score(input_n,target)

1.0

In [33]:
model.predict([[0,0,0]])

array([1], dtype=int64)